Revit 2024 API
UnitTypeId.Meganewtons Property
 Meganewtons.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId Meganewtons { get; }
Visual Basic
Public Shared ReadOnly Property Meganewtons As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Meganewtons {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace